# Reading Data From Excel

In [242]:
import pandas as pd
df_grades=pd.read_csv("C:\Pandas\Data\Grades_Short.csv")
df_grades.head() # displaying the first five rows by default

<>:2: SyntaxWarning: invalid escape sequence '\P'
<>:2: SyntaxWarning: invalid escape sequence '\P'
C:\Users\Mariam\AppData\Local\Temp\ipykernel_4568\194121087.py:2: SyntaxWarning: invalid escape sequence '\P'
  df_grades=pd.read_csv("C:\Pandas\Data\Grades_Short.csv")

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62

## Basic Features

##### Displaying the number of rows and columns respectively

In [24]:
df_grades.shape

(7, 10)

##### Data Type of Each Column

In [31]:
df_grades.dtypes

Name               object
Previous_Part     float64
Participation1      int64
Mini_Exam1        float64
Mini_Exam2          int64
Participation2      int64
Mini_Exam3        float64
Final             float64
Grade              object
ID                  int64
dtype: object

##### Get Columns Names

In [47]:
df_grades.columns #display all columns names by default

Index(['Name', 'Previous_Part', 'Participation1', 'Mini_Exam1', 'Mini_Exam2',
       'Participation2', 'Mini_Exam3', 'Final', 'Grade', 'ID'],
      dtype='object')

In [55]:
#if u need specific column's name
df_grades.columns[4]

'Mini_Exam2'

##### Get Rows Indicies Range

In [71]:
df_grades.index

RangeIndex(start=0, stop=7, step=1)

##### Calling columns

In [80]:
df_grades['Grade'] #it equlas df_grades.Grade but it differs if the name of cloumn more than one word
# A single Column

0     A
1     A
2    A-
3     A
4     A
5     B
6     A
Name: Grade, dtype: object

In [86]:
df_grades[['Grade','Name']]
# Multiple Columns

  Grade   Name
0     A   Jake
1     A    Joe
2    A-  Susan
3     A    Sol
4     A  Chris
5     B  Tarik
6     A  Malik

## Storing

In [91]:
names=df_grades['Name']
print(names)
# Stored

0     Jake
1      Joe
2    Susan
3      Sol
4    Chris
5    Tarik
6    Malik
Name: Name, dtype: object

## Slicing a Series

##### Contiguous slice

In [93]:
names[1:3]

1      Joe
2    Susan
Name: Name, dtype: object

##### Arbitary Slice

In [95]:
names[[0,3,4]]

0     Jake
3      Sol
4    Chris
Name: Name, dtype: object

## Slicing Data Frame

In [122]:
df_grades.loc[2,"ID"] # a specific slice

7625

In [126]:
df_grades.loc[2:5,"Name":"Final"] #Slicing in specific range for rows and columns

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final
2,Susan,30.0,1,19.0,19,1,10.5,33.0
3,Sol,31.0,1,22.0,13,1,13.0,34.0
4,Chris,30.0,1,19.0,17,1,12.5,33.5
5,Tarik,31.0,1,19.0,19,1,8.0,24.0

In [128]:
df_grades.loc[4:] # Displaying from specified row and all the columns

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62
5,Tarik,31.0,1,19.0,19,1,8.0,24.0,B,87452
6,Malik,31.5,1,20.0,21,1,9.0,36.0,A,9374

In [130]:
df_grades.iloc[3:6,2:6] # Slicing specific rows and columns using the range of their indcies

   Participation1  Mini_Exam1  Mini_Exam2  Participation2
3               1        22.0          13               1
4               1        19.0          17               1
5               1        19.0          19               1

## Built In Functions

In [135]:
df_grades.Mini_Exam3.mean()

11.0

In [167]:
df_grades.Mini_Exam2.min()

13

In [173]:
df_grades.Final.max()

36.0

In [187]:
df_grades['Final'].unique() #Display array of the values per column ignoring any repition

array([33. , 32. , 34. , 33.5, 24. , 36. ])

## Attributes

#### Feature that actually exist in the Data Frame they don't need void brackets at their ends

In [191]:
df_grades.shape

(7, 10)

In [199]:
df_grades.dtypes

Name               object
Previous_Part     float64
Participation1      int64
Mini_Exam1        float64
Mini_Exam2          int64
Participation2      int64
Mini_Exam3        float64
Final             float64
Grade              object
ID                  int64
dtype: object

### Methods

#### Require compututional calculations to release the output & you have to put the void brackets at their ends

In [206]:
df_grades.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            7 non-null      object
 1   Previous_Part   7 non-null      float64
 2   Participation1  7 non-null      int64
 3   Mini_Exam1      7 non-null      float64
 4   Mini_Exam2      7 non-null      int64
 5   Participation2  7 non-null      int64
 6   Mini_Exam3      7 non-null      float64
 7   Final           7 non-null      float64
 8   Grade           7 non-null      object
 9   ID              7 non-null      int64
dtypes: float64(4), int64(4), object(2)
memory usage: 692.0+ bytes

In [208]:
df_grades.describe()

,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,ID
count,7.000000,7.0,7.000000,7.000000,7.0,7.000000,7.000000,7.00000
mean,31.071429,1.0,19.785714,17.857143,1.0,11.000000,32.214286,29111.00000
std,0.838082,0.0,1.074598,2.734262,0.0,2.217356,3.828154,41131.08167
min,30.000000,1.0,19.000000,13.000000,1.0,8.000000,24.000000,62.00000
25%,30.500000,1.0,19.000000,16.500000,1.0,9.500000,32.500000,4260.50000
50%,31.000000,1.0,19.500000,19.000000,1.0,10.500000,33.000000,7625.00000
75%,31.750000,1.0,20.000000,19.500000,1.0,12.750000,33.750000,48413.00000
max,32.000000,1.0,22.000000,21.000000,1.0,14.000000,36.000000,90743.00000

## Creating New Columns

In [214]:
df_grades["Final percentage"]=(df_grades['Final']/36) *100
df_grades.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID,Final percentage
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743,91.666667
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284,88.888889
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625,91.666667
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237,94.444444
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62,93.055556

In [218]:
df_grades["avg of mini exams"]=(df_grades["Mini_Exam1"]+df_grades["Mini_Exam2"]+df_grades["Mini_Exam3"])/3
df_grades.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID,Final percentage,avg of mini exams
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743,91.666667,16.500000
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284,88.888889,16.666667
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625,91.666667,16.166667
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237,94.444444,16.000000
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62,93.055556,16.166667

## Deleting Columns

##### Deleting Single Column

In [224]:
del df_grades['Final percentage']
df_grades.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,ID,avg of mini exams
0,Jake,32.0,1,19.5,20,1,10.0,33.0,A,90743,16.500000
1,Joe,32.0,1,20.0,16,1,14.0,32.0,A,7284,16.666667
2,Susan,30.0,1,19.0,19,1,10.5,33.0,A-,7625,16.166667
3,Sol,31.0,1,22.0,13,1,13.0,34.0,A,1237,16.000000
4,Chris,30.0,1,19.0,17,1,12.5,33.5,A,62,16.166667

##### Deleting Multiple Columns

In [233]:
df_grades.drop(['Participation1','Participation2'],axis=1,inplace=True) # droping column of participation 1 & 2
df_grades.head()

,Name,Previous_Part,Mini_Exam1,Mini_Exam2,Mini_Exam3,Final,Grade,ID,avg of mini exams
0,Jake,32.0,19.5,20,10.0,33.0,A,90743,16.500000
1,Joe,32.0,20.0,16,14.0,32.0,A,7284,16.666667
2,Susan,30.0,19.0,19,10.5,33.0,A-,7625,16.166667
3,Sol,31.0,22.0,13,13.0,34.0,A,1237,16.000000
4,Chris,30.0,19.0,17,12.5,33.5,A,62,16.166667

In [235]:
df_grades.drop([0,1],axis=0,inplace=True) # dropping rows of index 0,1
df_grades.head()

,Name,Previous_Part,Mini_Exam1,Mini_Exam2,Mini_Exam3,Final,Grade,ID,avg of mini exams
2,Susan,30.0,19.0,19,10.5,33.0,A-,7625,16.166667
3,Sol,31.0,22.0,13,13.0,34.0,A,1237,16.000000
4,Chris,30.0,19.0,17,12.5,33.5,A,62,16.166667
5,Tarik,31.0,19.0,19,8.0,24.0,B,87452,15.333333
6,Malik,31.5,20.0,21,9.0,36.0,A,9374,16.666667

# Missing Data Calling

##### Replacing missing values Manually

In [309]:
import pandas as pd
df_missing=pd.read_csv("C:\Pandas\Data\Missing_Data.csv",na_values={"Mini_Exam2":"not available","Participation1":-1})
df_missing

<>:2: SyntaxWarning: invalid escape sequence '\P'
<>:2: SyntaxWarning: invalid escape sequence '\P'
C:\Users\Mariam\AppData\Local\Temp\ipykernel_4568\1276695693.py:2: SyntaxWarning: invalid escape sequence '\P'
  df_missing=pd.read_csv("C:\Pandas\Data\Missing_Data.csv",na_values={"Mini_Exam2":"not available","Participation1":-1})

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20.0,1,10.0,33.0,A,-1
1,Joe,NaN,1.0,20.0,16.0,1,14.0,32.0,A,23
2,Sol,31.0,1.0,22.0,13.0,1,13.0,34.0,A,34
3,Chris,30.0,NaN,19.0,NaN,1,12.5,33.5,A,72

##### Checking null values

In [313]:
df_missing=pd.read_csv("C:\Pandas\Data\Missing_Data.csv",na_values=["NaN","not available",-1])
df_missing.isnull()

<>:1: SyntaxWarning: invalid escape sequence '\P'
<>:1: SyntaxWarning: invalid escape sequence '\P'
C:\Users\Mariam\AppData\Local\Temp\ipykernel_4568\1759280506.py:1: SyntaxWarning: invalid escape sequence '\P'
  df_missing=pd.read_csv("C:\Pandas\Data\Missing_Data.csv",na_values=["NaN","not available",-1])

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,False,False,False,False,False,False,False,False,False,True
1,False,True,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False
3,False,False,True,False,True,False,False,False,False,False

In [294]:
df_missing.isnull().sum().count()

10

##### Dropping columns & rows that holds missing values

In [301]:
df_missing.dropna(axis=0,inplace=True) # Droping all the rows that include missing values
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
2,Sol,31.0,1.0,22.0,13.0,1,13.0,34.0,A,34.0

In [307]:
df_missing.dropna(axis=1,inplace=True) # Droping all the columns that include missing values
df_missing

    Name  Mini_Exam1  Participation2  Mini_Exam3  Final Grade  Temp
0   Jake        19.5               1        10.0   33.0     A    -1
1    Joe        20.0               1        14.0   32.0     A    23
2    Sol        22.0               1        13.0   34.0     A    34
3  Chris        19.0               1        12.5   33.5     A    72

##### Filling with specific values & describtive statistics

In [317]:
df_missing.fillna(0,inplace=False) #by specified value

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20.0,1,10.0,33.0,A,0.0
1,Joe,0.0,1.0,20.0,16.0,1,14.0,32.0,A,23.0
2,Sol,31.0,1.0,22.0,13.0,1,13.0,34.0,A,34.0
3,Chris,30.0,0.0,19.0,0.0,1,12.5,33.5,A,72.0

In [322]:
tempmean=df_missing.Temp.mean()
df_missing.fillna({'Temp':tempmean},inplace=False) # by one of describtive statistics (mean)

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp
0,Jake,32.0,1.0,19.5,20.0,1,10.0,33.0,A,43.0
1,Joe,NaN,1.0,20.0,16.0,1,14.0,32.0,A,23.0
2,Sol,31.0,1.0,22.0,13.0,1,13.0,34.0,A,34.0
3,Chris,30.0,NaN,19.0,NaN,1,12.5,33.5,A,72.0

##### Apply

In [335]:
def Bonus(marks):
    if marks >32:
        return 2
    else:
        return 0

df_missing['Bonus']=df_missing.Final.apply(Bonus)
df_missing

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade,Temp,Bonus
0,Jake,32.0,1.0,19.5,20.0,1,10.0,33.0,A,NaN,2
1,Joe,NaN,1.0,20.0,16.0,1,14.0,32.0,A,23.0,0
2,Sol,31.0,1.0,22.0,13.0,1,13.0,34.0,A,34.0,2
3,Chris,30.0,NaN,19.0,NaN,1,12.5,33.5,A,72.0,2